# Data-Science-0 - Semana 2 - Pré-processamento de dados em Python

Para esse desafio, vamos trabalhar com o data set [Black Friday](https://www.kaggle.com/mehdidag/black-friday), que reúne dados sobre transações de compras em uma loja de varejo.

Vamos utilizá-lo para praticar a exploração de data sets utilizando pandas. Você pode fazer toda análise neste mesmo notebook, mas as resposta devem estar nos locais indicados.

In [1]:
import pandas as pd
import numpy as np

In [2]:
#Leitura do CSV
black_friday = pd.read_csv("black_friday.csv")

## Inicio da análise

In [3]:
#Listagem das 5 primeiras linhas do dataframe
black_friday.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [4]:
#Informações do dataframe
black_friday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 537577 entries, 0 to 537576
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     537577 non-null  int64
 1   Product_ID                  537577 non-null  object
 2   Gender                      537577 non-null  object
 3   Age                         537577 non-null  object
 4   Occupation                  537577 non-null  int64
 5   City_Category               537577 non-null  object
 6   Stay_In_Current_City_Years  537577 non-null  object
 7   Marital_Status              537577 non-null  int64
 8   Product_Category_1          537577 non-null  int64
 9   Product_Category_2          370591 non-null  float64
 10  Product_Category_3          164278 non-null  float64
 11  Purchase                    537577 non-null  int64
dtypes: float64(2), int64(5), object(5)
memory usage: 49.2+ MB

In [5]:
#Descrição das variaveis do Dataframe
black_friday.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,5.375770e+05,537577.00000,537577.000000,537577.000000,370591.000000,164278.000000,537577.000000
mean,1.002992e+06,8.08271,0.408797,5.295546,9.842144,12.669840,9333.859853
std,1.714393e+03,6.52412,0.491612,3.750701,5.087259,4.124341,4981.022133
min,1.000001e+06,0.00000,0.000000,1.000000,2.000000,3.000000,185.000000
25%,1.001495e+06,2.00000,0.000000,1.000000,5.000000,9.000000,5866.000000
50%,1.003031e+06,7.00000,0.000000,5.000000,9.000000,14.000000,8062.000000
75%,1.004417e+06,14.00000,1.000000,8.000000,15.000000,16.000000,12073.000000
max,1.006040e+06,20.00000,1.000000,18.000000,18.000000,18.000000,23961.000000

## Questão 1

Quantas observações e quantas colunas há no dataset? Responda no formato de uma tuple `(n_observacoes, n_colunas)`.

In [6]:
#Listagem do numero de linhas e colunas do Dataset
def q1():
    return black_friday.shape

q1()

(537577, 12)

## Questão 2

Há quantas mulheres com idade entre 26 e 35 anos no dataset? Responda como um único escalar.

In [7]:
#Filtro de colunas usuario, sexo e idade
dataframe = black_friday[['User_ID','Gender','Age']]
dataframe.head()

   User_ID Gender   Age
0  1000001      F  0-17
1  1000001      F  0-17
2  1000001      F  0-17
3  1000001      F  0-17
4  1000002      M   55+

In [10]:
#Checando se a Idade está dentro do range
dataframe = dataframe[dataframe.Age == '26-35']
dataframe.head()

    User_ID Gender    Age
5   1000003      M  26-35
9   1000005      M  26-35
10  1000005      M  26-35
11  1000005      M  26-35
12  1000005      M  26-35

In [11]:
#Filtro de mulheres dentro do range
dataframe = dataframe[dataframe.Gender == 'F']
dataframe.head()

     User_ID Gender    Age
47   1000011      F  26-35
48   1000011      F  26-35
49   1000011      F  26-35
124  1000024      F  26-35
125  1000024      F  26-35

In [12]:
#batendo a chave de usuário, unico registro
dataframe['User_ID'].nunique()

545

In [14]:
#Função que faz a triagem de usuario, gexo e idade
def q2():
    dataframe = black_friday[['User_ID','Gender','Age']]
    dataframe = dataframe[dataframe.Age == '26-35']
    dataframe = dataframe[dataframe.Gender == 'F']
    return dataframe['User_ID'].nunique()
q2()

545

In [15]:
# Resposta oficial, sem considerar os usuários únicos:
black_friday.query('Gender == "F" & Age == "26-35"').shape[0]

49348

## Questão 3

Quantos usuários únicos há no dataset? Responda como um único escalar.

In [16]:
#Listagem de usuários unicos do Dataset
black_friday['User_ID'].unique()

array([1000001, 1000002, 1000003, ..., 1004113, 1005391, 1001529],
      dtype=int64)

In [17]:
#Total de usuarios unicos do Dataset
def q3():
    return black_friday['User_ID'].nunique()

q3()

5891

## Questão 4

Quantos tipos de dados diferentes existem no dataset? Responda como um único escalar.

In [18]:
#Tipos de variaveis diferentes dos Dataset
black_friday.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                        int64
dtype: object

In [19]:
#Função que retorna números de variaveis diferentes do Dataset
def q4():
    return black_friday.dtypes.nunique()
q4()

3

## Questão 5

Qual porcentagem dos registros possui ao menos um valor null (`None`, `NaN` etc)? Responda como um único escalar entre 0 e 1.

In [20]:
#qual linha tem pelo menos um NA? #total de linhas
total_linhas = black_friday.shape[0]

In [21]:
total_linhas_sem_na = black_friday.dropna(axis='index').shape[0]

In [22]:
total_linhas_na = total_linhas - total_linhas_sem_na

In [23]:
#Total da % de linhas que possui ao menos um valor Null no Dataset
total_linhas_na/total_linhas

0.6944102891306734

In [24]:
def q5():
    total_linhas = black_friday.shape[0]
    total_linhas_sem_na = black_friday.dropna(axis='index').shape[0]
    total_linhas_na = total_linhas - total_linhas_sem_na
    return total_linhas_na/total_linhas

q5()

0.6944102891306734

## Questão 6

Quantos valores null existem na variável (coluna) com o maior número de null? Responda como um único escalar.

In [45]:
#Total da Soma de valores Null 
black_friday.isna().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            166986
Product_Category_3            373299
Purchase                           0
dtype: int64

In [46]:
#Total da Soma de valores Null com Max
black_friday.isna().sum().max()

373299

In [49]:
#Função que lista  total da Soma de valores Null com Max
def q6():
    return int(black_friday.isna().sum().max())

q6()

373299

## Questão 7

Qual o valor mais frequente (sem contar nulls) em `Product_Category_3`? Responda como um único escalar.

In [28]:
#Analisando os dados da Product_Category_3  para saber qual o valor mais frequente aparece no Dataset
black_friday['Product_Category_3'].head()

0     NaN
1    14.0
2     NaN
3     NaN
4     NaN
Name: Product_Category_3, dtype: float64

In [29]:
black_friday['Product_Category_3'].dropna().mode()

0    16.0
dtype: float64

In [30]:
def q7():
    return float(black_friday['Product_Category_3'].dropna().mode())

q7()

16.0

## Questão 8

Qual a nova média da variável (coluna) `Purchase` após sua normalização? Responda como um único escalar.

$$ norm = (x - min) / (max - min) $$

In [31]:
min = black_friday.Purchase.min()
max = black_friday.Purchase.max()

In [51]:
(black_friday.Purchase - min) / (max-min)

0         0.344255
1         0.631519
2         0.052027
3         0.036676
4         0.327389
            ...
537572    0.482798
537573    0.799588
537574    0.330501
537575    0.293868
537576    0.281376
Name: Purchase, Length: 537577, dtype: float64

In [52]:
def q8():
    min = black_friday.Purchase.min()
    max = black_friday.Purchase.max()
    return float(((black_friday.Purchase - min) / (max-min)).mean())

q8()

0.38479390362696736

## Questão 9

Quantas ocorrências entre -1 e 1 inclusive existem da variáel `Purchase` após sua padronização? Responda como um único escalar.

$$ pad = (x - \bar{x}) / s $$

In [34]:
media = black_friday.Purchase.mean()
desvio = black_friday.Purchase.std()

In [35]:
padrao = pd.DataFrame(black_friday['Purchase'].copy())

In [36]:
padrao.Purchase = (padrao.Purchase - media) / desvio
padrao

        Purchase
0      -0.193506
1       1.177698
2      -1.588401
3      -1.661679
4      -0.274012
...          ...
537572  0.467804
537573  1.979943
537574 -0.259156
537575 -0.434019
537576 -0.493646

[537577 rows x 1 columns]

In [37]:
padrao.Purchase = padrao[padrao.Purchase <= 1]
padrao.Purchase = padrao[padrao.Purchase >= -1]

In [38]:
padrao.dropna()

        Purchase
0      -0.193506
4      -0.274012
9      -0.293687
10     -0.819081
12     -0.654657
...          ...
537571  0.505547
537572  0.467804
537574 -0.259156
537575 -0.434019
537576 -0.493646

[348631 rows x 1 columns]

In [39]:
padrao.shape[0]

537577

In [40]:
def q9():
    compras = black_friday['Purchase']
    padrao = (compras - compras.mean()) / compras.std()
    return int(((padrao >= -1) & (padrao <= 1)).sum())

q9()

348631

## Questão 10

Podemos afirmar que se uma observação é null em `Product_Category_2` ela também o é em `Product_Category_3`? Responda com um bool (`True`, `False`).

In [41]:
question_ten = black_friday[['Product_Category_2','Product_Category_3']]

In [42]:
nulos = question_ten[question_ten['Product_Category_2'].isna()]
nulos

        Product_Category_2  Product_Category_3
0                      NaN                 NaN
2                      NaN                 NaN
4                      NaN                 NaN
9                      NaN                 NaN
11                     NaN                 NaN
...                    ...                 ...
537563                 NaN                 NaN
537565                 NaN                 NaN
537566                 NaN                 NaN
537568                 NaN                 NaN
537575                 NaN                 NaN

[166986 rows x 2 columns]

In [43]:
def q10():
    return black_friday['Product_Category_2'].isna().equals(black_friday['Product_Category_2'].isna())

q10()

True